#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.http.myip: Reading...
data.http.myip: Read complete after 0s [id=http://ipv4.icanhazip.com]
module.aks.data.azurerm_kubernetes_cluster.credentials: Reading...
module.aks.data.azurerm_subscription.primary: Reading...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork]
data.azurerm_kubernetes_cluster.credentials: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kNWRhODZjNy00YjViLTQ0OGYtOGZkNC0wOGU5YzdhMjE3MmY7b2JqZWN0SWQ9OTkwNTNlMDgtODdiNi00NTg1LWI3N2QtZTlkMjA3MjU1MWViO3N1YnNjcmlwdGlvbklkPWRjZDg4ODU1LTcwZGYtNDlhMC05ZjE1LWE5MTk0MWJiYTAzNDt0ZW5hbnRJZD03ZjhjYWZjOC00MzE0LTQwNzAtOTc0NC1mZTAyZjkxYmNiMjE=]
module.aks.data.azurerm_subscription.primary: Read complete after 0s [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034]
module.aks.azurerm_role_definition.aks_reader: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/providers/Microsoft.Authorization/roleDefinitions/1557f53b-9436-af98-25c6-5e4cf1740fa6|/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034]
module.keyvault.azurerm_key_vault.keyvalue: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.KeyVault/vaults/kv-polinetwork]
module.aks.azurerm_kubernetes_cluster.k8s: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.ContainerService/managedClusters/aks-polinetwork]
data.azurerm_key_vault_secret.dev_db_user: Reading...
data.azurerm_key_vault_secret.prod_mod_bot_token: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_db_password: Reading...
data.azurerm_key_vault_secret.dev_db_password: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_auth_password: Reading...
data.azurerm_key_vault_secret.dev_db_host: Reading...
data.azurerm_key_vault_secret.ca_tls_crt: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_db_password: Read complete after 1s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-db-password/fec69ab391b54174b8291c5f6f8501b6]
data.azurerm_key_vault_secret.dev_mat_config_password: Reading...
data.azurerm_key_vault_secret.dev_db_user: Read complete after 2s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-db-user/fd6f78a35a91432aa18556407be83644]
data.azurerm_key_vault_secret.prod_tutorapp_auth_user: Reading...
data.azurerm_kubernetes_cluster.credentials: Read complete after 3s [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.ContainerService/managedClusters/aks-polinetwork]
data.azurerm_key_vault_secret.prod_bot_mat_db_user: Reading...
module.aks.data.azurerm_kubernetes_cluster.credentials: Read complete after 3s [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.ContainerService/managedClusters/aks-polinetwork]
data.azurerm_key_vault_secret.prod_tutorapp_bot_token: Reading...
data.azurerm_key_vault_secret.prod_mod_bot_token: Read complete after 2s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-mod-bot-token/5aef155b159b492891f3b17948073324]
data.azurerm_key_vault_secret.dev_mod_bot_token: Reading...
data.azurerm_key_vault_secret.dev_db_password: Read complete after 3s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-db-password/d3136bf3111241c584924ad83e1bd5ff]
data.azurerm_key_vault_secret.dev_app_admin_db_user: Reading...
data.azurerm_key_vault_secret.prod_mod_db_user: Reading...
data.azurerm_key_vault_secret.ca_tls_crt: Read complete after 3s [id=https://kv-polinetwork.vault.azure.net/secrets/ca-crt/a63381c2535d4084be76b27f2ad52555]
data.azurerm_key_vault_secret.prod_bot_mat_db_password: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_auth_password: Read complete after 4s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-auth-password/66f9aea124844260a117ef8f884e1e11]
data.azurerm_key_vault_secret.argocd_client_id: Reading...
data.azurerm_key_vault_secret.dev_db_host: Read complete after 4s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-db-host/6ddefea6cdb34afc8e9f38c1e5582cf1]
data.azurerm_key_vault_secret.admin_db_password: Reading...
data.azurerm_key_vault_secret.dev_mat_config_password: Read complete after 4s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-mat-config-password/1cdf8fcef56c4492b8879ec7c0744cc0]
data.azurerm_key_vault_secret.prod_tutorapp_db_user: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_auth_user: Read complete after 3s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-auth-user/6b6950343fad4c71904ee00df2a890ba]
data.azurerm_key_vault_secret.prod_bot_mat_token: Reading...
data.azurerm_key_vault_secret.prod_bot_mat_db_user: Read complete after 4s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-bot-mat-db-user/1a576db34de34238bdfc1e4a629c6d7a]
data.azurerm_key_vault_secret.ca_tls_key: Reading...
data.azurerm_key_vault_secret.prod_tutorapp_bot_token: Read complete after 4s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-bot-token/1bccd79f70ac42ae9d0b877af02a2542]
data.azurerm_key_vault_secret.dev_app_secret_token: Reading...
data.azurerm_key_vault_secret.dev_mod_bot_token: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-mod-bot-token/1b37830ceb1f4ef19d844d751bbbdcea]
data.azurerm_key_vault_secret.prod_db_password: Reading...
data.azurerm_key_vault_secret.dev_app_admin_db_user: Read complete after 4s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-app-admin-db-user/457ce3fd1acb4a79b821f8e5d880fd3e]
data.azurerm_key_vault_secret.dev_app_admin_db_password: Reading...
data.azurerm_key_vault_secret.prod_mod_db_user: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-mod-db-user/75dc80fca95f46d3a05e820ecbefe406]
data.azurerm_key_vault_secret.argocd_client_secret: Reading...
data.azurerm_key_vault_secret.prod_bot_mat_db_password: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-bot-mat-db-password/082663ce438f414aa85455703a5e3b6e]
data.azurerm_key_vault_secret.argocd_client_id: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/argocd-client-id/1b49dc14ae034595bf5c74e255ee8ddf]
module.aks.kubernetes_cluster_role_binding.adminorg: Refreshing state... [id=admin-global]
module.aks.kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
data.azurerm_key_vault_secret.admin_db_password: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/admin-db-password/33d587ac42324bb6bda55b7db228da4b]
module.aks.kubernetes_namespace.argocd: Refreshing state... [id=nginx-ingress]
module.aks.helm_release.ingress-nginx: Refreshing state... [id=ingress-nginx]
module.aks.helm_release.cert-manager-controller: Refreshing state... [id=jetstack]
data.azurerm_key_vault_secret.prod_tutorapp_db_user: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-tutorapp-db-user/2bed20e87fca47ccb8d5b8da026100dc]
data.azurerm_key_vault_secret.prod_bot_mat_token: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-bot-mat-token/3303faadab4448e0a689eb431d0062dd]
module.aks.kubernetes_manifest.cert-argo-dex: Refreshing state...
data.azurerm_key_vault_secret.ca_tls_key: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/ca-key/7a2b6efe49184e8e936a50377ccd88e2]
module.aks.kubernetes_secret.internal-ca: Refreshing state... [id=default/internal-ca]
module.aks.module.cert_manager.helm_release.cert_manager: Refreshing state... [id=cert-manager]
data.azurerm_key_vault_secret.dev_app_secret_token: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-app-secret-token/eb0a0ffd8821415eb68c7dc3d4d2faf8]
module.aks.module.cert_manager.time_sleep.wait: Refreshing state... [id=2023-01-15T22:34:16Z]
module.aks.module.cert_manager.kubectl_manifest.cluster_issuer[0]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt-prod-issuer]
data.azurerm_key_vault_secret.prod_db_password: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/prod-db-password/5e8e79f481ce479a95c39578bf25c469]
module.argo-cd.kubernetes_namespace.argocd: Refreshing state... [id=argocd]
data.azurerm_key_vault_secret.dev_app_admin_db_password: Read complete after 6s [id=https://kv-polinetwork.vault.azure.net/secrets/dev-app-admin-db-password/fe5d5bdca3304795956e20322d61b0d8]
module.argo-cd.kubernetes_manifest.cert-argo-dex: Refreshing state...
data.azurerm_key_vault_secret.argocd_client_secret: Read complete after 5s [id=https://kv-polinetwork.vault.azure.net/secrets/argocd-client-secret/e6fb112c796342e085dce42856257ed4]
module.argo-cd.helm_release.argo_cd: Refreshing state... [id=argo]
module.argo-cd.helm_release.argocd_apps: Refreshing state... [id=argocd-apps]
module.mariadb.kubernetes_namespace.mariadb: Refreshing state... [id=mariadb]
module.mariadb.azurerm_managed_disk.storage: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.Compute/disks/md-polinetwork]
module.mariadb.kubernetes_role_binding.app_dev: Refreshing state... [id=mariadb/db-dev-bind]
module.mariadb.kubernetes_config_map.initdb: Refreshing state... [id=mariadb/scripts]
module.mariadb.kubernetes_role.db_dev: Refreshing state... [id=mariadb/DBDev]
module.mariadb.kubernetes_service.mariadb_service: Refreshing state... [id=mariadb/mariadb]
module.mariadb.kubernetes_secret.initdb: Refreshing state... [id=mariadb/initdb]
module.mariadb.kubernetes_secret.mariadb_admin: Refreshing state... [id=mariadb/mariadb-secret]
module.mariadb.kubernetes_persistent_volume.storageaks: Refreshing state... [id=mariadb-persistent-volume]
module.mariadb.kubernetes_persistent_volume_claim.mariadb_storage: Refreshing state... [id=mariadb/mariadb-storage-claim]
module.tutorapp.kubernetes_secret.tutorapp_secret: Refreshing state... [id=tutor-prod/tutorapp-config-secret]
module.bot_mod_dev.random_uuid.volume: Refreshing state... [id=82d874fc-ddcf-7b10-d817-0a0a48e99713]
module.bot_mod_prod.random_uuid.volume: Refreshing state... [id=bdf6cceb-12b3-41c2-0c11-241080e928d0]
module.bot_mod_prod.kubernetes_namespace.bot-namespace: Refreshing state... [id=bot-prod]
module.bot_mat_prod.random_uuid.volume: Refreshing state... [id=ff0f262a-01ef-62f6-af47-3a38a72bfdf1]
module.bot_mod_dev.kubernetes_namespace.bot-namespace: Refreshing state... [id=bot-dev]
module.app_dev.kubernetes_role.app_dev: Refreshing state... [id=app-dev/AppDev]
module.bot_mat_prod.kubernetes_secret.bot_secret: Refreshing state... [id=bot-mat/bot-config-secret]
module.bot_mod_prod.kubernetes_secret.bot_secret: Refreshing state... [id=bot-prod/bot-config-secret]
module.app_dev.kubernetes_role_binding.app_dev: Refreshing state... [id=app-dev/app-dev-bind]
module.bot_mod_dev.kubernetes_secret.bot_secret: Refreshing state... [id=bot-dev/bot-config-secret]
module.app_dev.kubernetes_secret.app_secret: Refreshing state... [id=app-dev/app-secrets]
module.bot_mat_prod.kubernetes_namespace.bot-namespace: Refreshing state... [id=bot-mat]
module.bot_mat_prod.azurerm_managed_disk.storage[0]: Refreshing state... [id=/subscriptions/dcd88855-70df-49a0-9f15-a91941bba034/resourceGroups/rg-polinetwork/providers/Microsoft.Compute/disks/md-polinetwork-ff0f262a-01ef-62f6-af47-3a38a72bfdf1]
module.bot_mat_prod.kubernetes_persistent_volume.storage[0]: Refreshing state... [id=ff0f262a-01ef-62f6-af47-3a38a72bfdf1-bot-pv]
module.bot_mat_prod.kubernetes_persistent_volume_claim.storage_pvc[0]: Refreshing state... [id=bot-mat/bot-pvc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.comms.azurerm_communication_service.comms will be created
  + resource "azurerm_communication_service" "comms" {
      + data_location               = "Europe"
      + id                          = (known after apply)
      + name                        = "cs-polinetwork"
      + primary_connection_string   = (known after apply)
      + primary_key                 = (known after apply)
      + resource_group_name         = "rg-polinetwork"
      + secondary_connection_string = (known after apply)
      + secondary_key               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Eliaxie, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*